//  Вычислить площадь круга

package javacore.chapter03;

public class Area {
    public static void main(String[] args) {

        double pi, r, a;

        r = 10.8;
        pi = 3.1416;
        a = pi * r * r;
        // радиус окружности
        // приблизительное значение числа пи
        // вычислить площадь круга
        System.out.println("Плoщaдь круга равна" + a);
    }
}
// Плoщaдь круга равна 366.436224